subjects_rsosh = {'Математика': ["Олимпиада «Высшая проба» по математике",
                                 "Московская математическая олимпиада",
                                 "Олимпиада школьников «Ломоносов» по математике",
                                 "Олимпиада «Покори Воробьевы горы!» по математике",
                                 "Олимпиада СПбГУ по математике",
                                 "Санкт-Петербургская олимпиада школьников по математике",
                                 "Турнир городов",
                                 "Всесибирская олимпиада школьников по математике",
                                 "Межрегиональная олимпиада школьников им. И.Я. Верченко по математике и криптографии",
                                 "Межрегиональная олимпиада школьников на базе ведомственных образовательных "
                                 "организаций (математика)",
                                 "Объединенная межвузовская математическая олимпиада",
                                 "Объединенная международная математическая олимпиада «Формула Единства» "
                                 "/ «Третье тысячелетие»",
                                 "Олимпиада Курчатов по математике", "Олимпиада школьников «Физтех» по математике",
                                 "Олимпиада Юношеской математической школы", "Олимпиада «Росатом» по математике",
                                 "Турнир Ломоносова",
                                 "Олимпиада «Миссия выполнима. Твое призвание - финансист!» по математике",
                                 "Межрегиональная олимпиада школьников по математике «САММАТ»",
                                 "Олимпиада «Будущие исследователи - будущее науки» по математике",
                                 "Транспортная олимпиада «Паруса надежды» по математике",
                                 "Многопрофильная олимпиада УрФУ для школьников «Изумруд» по математике",
                                 "Олимпиада Университета Иннополис «Innopolis Open» по математике",
                                 "Олимпиада «Шаг в будущее» по математике",
                                 "Открытая олимпиада школьников (математика)",
                                 "Открытая олимпиада вузов Томской области по математике",
                                 "Университетская олимпиада школьников «Бельчонок» по математике"],

                  'Физика': ["Московская олимпиада по физике", "Олимпиада «Покори Воробьевы горы!» по физике",
                             "Олимпиада школьников «Физтех» по физике", "Олимпиада «Росатом» по физике",
                             "Всесибирская олимпиада школьников по физике",
                             "Городская открытая олимпиада школьников по физике",
                             "Инженерная олимпиада школьников", "Интернет-олимпиада школьников по физике",
                             "Олимпиада Курчатов по физике", "Олимпиада школьников «Ломоносов» по физике",
                             "Олимпиада школьников «Робофест» по физике", "Олимпиада «Шаг в будущее» по физике",
                             "Олимпиада СПбГУ по физике", "Турнир Ломоносова", "Олимпиада «Наследники Левши»",
                             "Олимпиада «Высшая проба» по физике",
                             "Олимпиада «Будущие исследователи - будущее науки» по физике",
                             "Межрегиональная олимпиада школьников на базе ведомственных "
                             "образовательных организаций (физика)",
                             "Олимпиада Казанского федерального университета по физике",
                             "Многопрофильная олимпиада УрФУ для школьников «Изумруд» по физике",
                             "Олимпиада «Формула Единства»/«Третье тысячелетие» по физике",
                             "Олимпиада школьников «Надежда энергетики» по физике",
                             "Открытая межвузовская олимпиада школьников «Будущее Сибири» по физике",
                             "Открытая олимпиада вузов Томской области по физике", "Олимпиада «Газпром»"],

                  'Химия': ["Всесибирская олимпиада школьников по химии", "Олимпиада «Юные таланты» по химии",
                            "Московская олимпиада по химии", "Олимпиада школьников «Ломоносов» по химии",
                            "Олимпиада СПбГУ по химии", "Санкт-Петербургская олимпиада по химии",
                            "Олимпиада «Высшая проба» по химии",
                            "Олимпиада «Будущие исследователи - будущее науки» по химии",
                            "Олимпиада Казанского федерального университета по химии",
                            "Олимпиада школьников «Гранит науки» по химии",
                            "Открытая межвузовская олимпиада школьников «Будущее Сибири» по химии",
                            "Открытая химическая олимпиада", "Олимпиада «Газпром»", "Турнир Ломоносова",
                            "Университетская олимпиада школьников «Бельчонок» по химии"],

                  'Биология': ["Олимпиада школьников «Ломоносов» по биологии",
                               "Олимпиада «Покори Воробьевы горы!» по биологии",
                               "Олимпиада СПбГУ по биологии", "Олимпиада «Высшая проба» по биологии",
                               "Всесибирская олимпиада школьников по биологии",
                               "Олимпиада «Будущие исследователи - будущее науки» по биологии", "Турнир Ломоносова",
                               "Всероссийская Сеченовская олимпиада школьников по биологии",
                               "Олимпиада «Физтех.Био» по биологии"],

                  'География': ["Олимпиада «Юные таланты» по географии", "Московская олимпиада по географии",
                                "Олимпиада школьников «Ломоносов» по географии", "Олимпиада СПбГУ по географии",
                                "Герценовская олимпиада школьников по географии",
                                "Олимпиада «Покори Воробьевы горы!» по географии",
                                "Олимпиада Северо-кавказского федерального университета «45 параллель» по географии",
                                "Открытая олимпиада вузов Томской области по географии"],

                  'История': ["Олимпиада «Высшая проба» по истории", "Олимпиада школьников «Ломоносов» по истории",
                              "Олимпиада СПбГУ по истории", "Олимпиада школьников «В начале было Слово...»",
                              "Всероссийская Толстовская олимпиада школьников по истории",
                              "Олимпиада «Будущие исследователи - будущее науки» по истории",
                              "Московская олимпиада по истории",
                              "Олимпиада РГГУ для школьников по истории",
                              "Олимпиада «Покори Воробьевы горы!» по истории",
                              "Олимпиада РАНХиГС по истории", "Открытая олимпиада вузов Томской области по истории",
                              "Турнир Ломоносова",
                              "Олимпиада «Миссия выполнима. Твое призвание - финансист!» по истории",
                              "Многопрофильная олимпиада УрФУ для школьников «Изумруд» по истории",
                              "Олимпиада «Океан знаний» по истории", "Олимпиада школьников «В мир права»"],

                  'Обществознание': ["Олимпиада «Высшая проба» по обществознанию",
                                     "Олимпиада школьников «Ломоносов» по обществознанию",
                                     "Олимпиада «Покори Воробьевы горы!» по обществознанию",
                                     "Олимпиада СПбГУ по обществознанию",
                                     "Олимпиада «Государственный аудит»", "Московская олимпиада по обществознанию",
                                     "Олимпиада РАНХиГС по обществознанию",
                                     "Олимпиада «Миссия выполнима. Твое призвание - финансист!» по обществознанию",
                                     "Всероссийская Толстовская олимпиада школьников по обществознанию",
                                     "Межрегиональная олимпиада школьников на базе ведомственных образовательных организаций"
                                     " (обществознание)",
                                     "Многопрофильная олимпиада УрФУ для школьников «Изумруд» по обществознанию",
                                     "Олимпиада «Океан знаний» по обществознанию"],

                  'Право': ["Олимпиада «Высшая проба» по праву", "Олимпиада школьников «Ломоносов» по праву",
                            "Олимпиада СПбГУ по праву",
                            "Олимпиада по праву Московской государственной юридической академии имени О. Е. Кутафина",
                            "Межрегиональная олимпиада по праву «Фемида»", "Московская олимпиада по праву",
                            "Олимпиада школьников «В мир права»"],

                  'Экономика': ["Олимпиада «Высшая проба» по экономике",
                                "Межрегиональная экономическая олимпиада школьников имени Н. Д. Кондратьева",
                                "Экономический фестиваль «Сибириада. Шаг в мечту!»",
                                "Московская олимпиада по экономике",
                                "Олимпиада СПбГУ по экономике",
                                "Олимпиада «Миссия выполнима. Твое призвание - финансист!» по экономике",
                                "Олимпиада РАНХиГС по экономике", "Плехановская олимпиада по экономике"],

                  'Русский язык': ["Олимпиада школьников «Ломоносов» по русскому языку",
                                   "Олимпиада «Высшая проба» по русскому языку",
                                   "Олимпиада «Будущие исследователи - будущее науки» по русскому языку",
                                   "Олимпиада РГГУ для школьников по русскому языку",
                                   "Плехановская олимпиада по русскому языку",
                                   "Многопрофильная олимпиада УрФУ для школьников «Изумруд» по русскому языку",
                                   "Олимпиада «Океан знаний» по русскому языку",
                                   "Открытая олимпиада вузов Томской области по русскому языку"],

                  'Литература': ["Олимпиада школьников «Ломоносов» по литературе",
                                 "Олимпиада «Покори Воробьевы горы!» по литературе",
                                 "Олимпиада РГГУ для школьников по литературе",
                                 "Открытая олимпиада вузов Томской области по литературе", "Турнир Ломоносова",
                                 "Олимпиада школьников «В начале было Слово...»",
                                 "Всероссийская Толстовская олимпиада школьников по литературе"],

                  'Лингвистика': ["Московская традиционная олимпиада по лингвистике", "Турнир Ломоносова"],

                  'Английский язык': ["Олимпиада РАНХиГС по английскому языку",
                                      "Плехановская олимпиада по иностранным языкам"],

                  'Немецкий язык': ["Плехановская олимпиада по иностранным языкам"],

                  'Китайский язык': ["Олимпиада СПбГУ по китайскому языку", "Олимпиада РАНХиГС по китайскому языку"],

                  'Итальянский язык': [],

                  'Испанский язык': [],

                  'Французский язык': [],

                  'Астрономия': ["Московская астрономическая олимпиада",
                                 "Санкт-Петербургская астрономическая олимпиада",
                                 "Всесибирская олимпиада школьников по астрономии"],

                  'Экология': ["Всероссийский конкурс научных работ школьников «Юниор» по естественным наукам",
                               "Инженерная олимпиада «Звезда» по технике и технологии",
                               "Олимпиада Национальной технологической инициативы",
                               "Олимпиада школьников «Ломоносов» по экологии"],

                  'Робототехника': ["Московская олимпиада по робототехнике",
                                    "Олимпиада школьников «Ломоносов» по робототехнике"],

                  'Технология': ["Инженерная олимпиада «Звезда» по естественным наукам",
                                 "Транспортная олимпиада «Паруса надежды» по технике и технологии"],

                  'Искусство': ["Международная олимпиада школьников «Искусство графики»",
                                "Межрегиональная олимпиада имени В. Е. Татлина",
                                "Всероссийская олимпиада учащихся музыкальных училищ и колледжей по предмету «Теория и "
                                "история музыки»",
                                "Южно-Российская межрегиональная олимпиада школьников «Архитектура и искусство»",
                                "Всероссийская олимпиада учащихся музыкальных училищ и колледжей по предмету «Инструменты "
                                "народного оркестра»",
                                "Всероссийская олимпиада учащихся музыкальных училищ и колледжей по предмету "
                                "«Музыкальная педагогика и исполнительство (фортепиано)»",
                                "Всероссийская олимпиада учащихся музыкальных училищ и колледжей по "
                                "предмету «Струнные инструменты»",
                                "Межрегиональная олимпиада «Архитектура и искусство» по комплексу предметов",
                                "Межрегиональная олимпиада имени В. Е. Татлина", "Московская олимпиада по ИЗО",
                                "Московская олимпиада по истории искусств", "Московская олимпиада по истории искусств"],

                  'Черчение': ["Южно-Российская межрегиональная олимпиада школьников «Архитектура и искусство»"],

                  'Психология': ["Олимпиада школьников «Ломоносов» по психологии",
                                 "Олимпиада «Высшая проба» по психологии"],

                  'Физкультура': [],

                  'Предпринимательство': [],
                  'Информатика': ["Олимпиада «Высшая проба» по информатике", "Олимпиада «Высшая проба» по информатике",
                                  "Московская олимпиада по информатике",
                                  "Олимпиада школьников «Ломоносов» по информатике",
                                  "Олимпиада школьников по информатике и программированию",
                                  "Олимпиада по программированию «ТехноКубок»", "Олимпиада СПбГУ по информатике",
                                  "Открытая олимпиада школьников (информатика)",
                                  "Открытая олимпиада по программированию",
                                  "Олимпиада Университета Иннополис «Innopolis Open» по информатике",
                                  "Олимпиада «Гранит науки» по информатике"], }

numbers = {"Информатика": "7", "Математика": "6", "Физика": "12", "Химия": "13", "Биология": "11", "География": "10",
           "История": "8", "Обществознание": "9", "Право": "15", "Экономика": "14", 'Французский язык': "5",
           "Испанский язык": "25", "Русский язык": "1", "Немецкий язык": "4", "Литература": "2", "Лингвистика": "24",
           "Китайский язык": "29", "Итальянский язык": "30", "Английский язык": "3", "Астрономия": "20",
           "Экология": "21",
           "Робототехника": "27", "Технология": "17", "Искусство": "18", "ИЗО": "22", "Черчение": "31",
           "Психология": "28",
           "ОБЖ": "16", "Физкультура": "19", "Предпринимательство": "23"}

months = {'января': '01', 'февраля': '02', 'марта': '03', 'апреля': '04', 'мая': '05', 'июня': '06', 'июля': '07',
          'августа': '08', 'сентября': '09', 'октября': '10', 'ноября': '11', 'декабря': '12'}

months2 = ['января', 'февраля', 'марта', 'апреля', 'мая', 'июня', 'июля', 'августа', 'сентября', 'октября', 'ноября',
           'декабря']

sub = {"Русский язык": "Русском языке", "Английский язык": "Английском языке", "Испанский язык": "Испанском языке",
       "Немецкий язык": "Немецком языке", "Китайский язык": "Китайском языке", "Итальянский язык": "Итальянском языке",
       "Французский язык": "Французском языке", "Математика": "Математике"}

lis_of_subjects = ['Информатика  \n', 'Математика  \n', 'Физика  \n', 'Химия  \n', 'Биология  \n', 'География  \n',
                   'История  \n',
                   'Обществознание  \n', 'Право  \n', 'Экономика  \n', 'Русский язык  \n', 'Немецкий язык  \n',
                   'Французский язык  \n',
                   'Испанский язык  \n', 'Литература  \n', 'Лингвистика  \n', 'Английский язык  \n',
                   'Астрономия  \n', 'Робототехника  \n', 'Технология  \n', 'Искусство  \n', 'Черчение  \n',
                   'Психология  \n']
